# Main Brewfile
# Robert van Bregt

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

tap "buo/cask-upgrade"

brew "mas"
brew "svn"

# --- Formulae ---

brew "coreutils"
brew "exiftool"
brew "hugo"
brew "imagemagick"
brew "imageoptim-cli"
brew "multimarkdown"
brew "pandoc"
brew "rename"
brew "stow"
brew "terminal-notifier"

# brew "bitwarden-cli"
# brew "tmux"

# --- Fonts ---

cask "font-fira-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-mono"  # requires svn package
cask "font-oswald"

# --- Mac App Store

# Place these before casks, to prefer MAS if accidentally listed in both

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Home Assistant", id: 1099568401
mas "Things", id: 904280696

# --- Casks / Applications ---

cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "bartender"
cask "backblaze"
cask "bbedit" 
cask "bettertouchtool"
# cask "calibre"
cask "coconutbattery"
cask "controlplane"
cask "cryptomator"
cask "cyberduck"
cask "digikam"
cask "firefox", args: { language: "nl" }
cask "hocus-focus"
cask "imageoptim"
cask "iterm2"
cask "keyboardcleantool"
# cask "libreoffice"
# cask "libreoffice-language-pack"
cask "namechanger"
cask "nvalt"
cask "obsidian"
cask "omnidisksweeper"
cask "private-internet-access"
cask "rectangle"
cask "scroll-reverser"
cask "signal"
cask "spotify"
cask "sync"
cask "ubersicht"
cask "vlc"

# cask "adobe-digital-editions"
# cask "caffeine"
# cask "devonthink"
# cask "hazel # using an older version
# cask "keyboard-maestro" # using an older version
# cask "thunderbird"
# cask "vscodium"
# cask "zotero"

# --- Drivers ---

# cask "garmin-basecamp"
# cask "garmin-express"
# cask "jabra-direct"
# cask "logitech-camera-settings" # webcam
# cask "logitech-options"         # mouse / keyboard
# cask "logitech-unifying"        # mouse / keyboard
# cask "samsung-portable-ssd-t5"
# cask "sonos"
# cask "yubico-yubikey-personalization-gui"




